{"pages":[],"posts":[{"title":"Test","text":"","link":"/2020/05/15/Test/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/05/15/hello-world/"},{"title":"TF3","text":"daunting：intimidating, discouraging, frightening, disheartening, unnerving, dismaying demoralizing, formidable delineate(de- : emphasize -ate) spect- perspective 透视; 视角（per- 每一个） from the … spectator 观众 spectacle 景象；景观（make a spectacle of oneself 出洋相） spectacles 眼镜 specsaver : 可能是眼镜店 inspect; retrospect 回归 回溯; introspect introspect 反省 in retrospect prospect; 可能性；前途 spectrum, -spi- despise: look down on; show contempt at ( despicable me ) perspicacious(insightful) adj. a ~ analysis of the issue conspicuous : attention-getting（引人瞩目的）; salient literal 字面意义的; lateral 侧面的，横向的 （bilateral 双边的）; literate 受教育的 the liberal arts education; liberal-minded liberty; liberate v.(the liberal arts education) initiate; initiative (take one’s initialtive) curve marking on a curve/grading on a curve 正态 a curve wrecker 学霸 dissolve v. solution（溶液）; solvent（溶剂） absolve 赦免；排除 be absolved from : be exempt from the most vigorous opponent of … proponent; exponent immense; enormous; appreciable pique one’s curiosity:: arouse; stimulate; catalyse; evoke; trigger; spark -cast broadcast; sportscast; podcast; vlog; live-streaming be subject to : be prone/vulnerable to assault: attack celestial: heavenly ( the celestial beauty of one’s voice) create/produce/exert a () impact describing large amount far-reaching;decisive; remarkable; appreciable; immense; enormous; tremendous small subtle; minimal; marginal; negligible; moderate 负面 adverse; destructive; catastrophic; debilitating; deleterious; crippling; paralysing; detrimental; 好的 beneficial; positive 连锁的 domino; knock-on; spin-off; ripple overtake; transcend; surpass supersede: supplant assiduous adj. assiduity n. 勤奋的 (studious; sedulous) sedate adj. 冷静的 sedative n. 镇定剂 dissident 持不同政见者 subside v. terra- 地形","link":"/2020/05/06/TF3/"}],"tags":[{"name":"English Notes","slug":"English-Notes","link":"/tags/English-Notes/"}],"categories":[]}